{
    "intents": [
        {
            "id": 7,
            "tag": "admissions_process",
            "patterns": [
                "Can you explain the admission process?",
                "How does the admission process work?",
                "Tell me about the steps for admission."
            ],
            "responses": [
                "The admission process typically involves submitting an application form, providing necessary documents, and meeting specific criteria. You can find detailed information on our website or contact our admissions office for assistance."
            ]
        },
        {
            "id": 9,
            "tag": "application_deadline",
            "patterns": [
                "When is the application deadline?",
                "What is the deadline for applying?",
                "Can you tell me when applications close?"
            ],
            "responses": [
                "The application deadline varies depending on the program and semester. It's important to check our website or contact the admissions office to confirm the deadline for your specific situation."
            ]
        },
        {
            "id": 10,
            "tag": "program_information",
            "patterns": [
                "Can you provide information about the programs offered?",
                "What programs does CVSU offer?",
                "Tell me about the available courses."
            ],
            "responses": [
                "CVSU offers a wide range of programs across various disciplines, including arts, sciences, engineering, and business. You can explore our website for detailed information on each program, including curriculum, faculty, and career prospects."
            ]
        },
        {
            "id": 12,
            "tag": "application_process",
            "patterns": [
                "How do I apply?",
                "What is the application process?",
                "Can you guide me through the application?"
            ],
            "responses": [
                "To apply, fill out the online admission form, submit required documents, and refer to the posted updates."
            ]
        },
        {
            "id": 13,
            "tag": "important_dates",
            "patterns": [
                "What are the important dates?",
                "When is the application deadline?",
                "When does the admission period start?"
            ],
            "responses": [
                "Admission deadlines and dates vary. Check the official CvSU website for accurate information."
            ]
        },
        {
            "id": 16,
            "tag": "document_submission",
            "patterns": [
                "Where do I submit my documents?",
                "How can I send my documents?"
            ],
            "responses": [
                "Submit your documents online through the CvSU admission portal."
            ]
        },
        {
            "id": 17,
            "tag": "application_status",
            "patterns": [
                "How do I check my application status?",
                "Can I track my application?"
            ],
            "responses": [
                "Check your application status by logging into your CvSU admission portal account."
            ]
        },
        {
            "id": 18,
            "tag": "technical_issues",
            "patterns": [
                "I'm facing technical issues with the application portal",
                "The website is not working properly"
            ],
            "responses": [
                "Please provide details of the issue you're facing, and we'll assist you."
            ]
        },
        {
            "id": 20,
            "tag": "program_information",
            "patterns": [
                "What programs does CvSU offer?",
                "Can I get information about specific courses?"
            ],
            "responses": [
                "CvSU Main Campus offers various undergraduate and graduate programs. Explore them on the CvSU website https:\/\/cvsu.edu.ph\/course-offerings\/."
            ]
        },
        {
            "id": 24,
            "tag": "orientation",
            "patterns": [
                "Is there a student orientation program?",
                "When is the orientation for new students?"
            ],
            "responses": [
                "Please refer to posted updates."
            ]
        },
        {
            "id": 25,
            "tag": "international_students",
            "patterns": [
                "Do you accept international students?",
                "What are the requirements for international students?"
            ],
            "responses": [
                "CvSU Main Campus welcomes international students!\n\n1. Undergo online application using the link (https:\/\/registrar.cvsu.edu.ph\/osas\/) to encode completely the needed information in the application form and print it on A4-size bond paper.\n2. Show the certified true copy of documentary requirements at the University Registrar Office for verification\n3. Submit the accomplished form and requirements at the Office of Student Affairs And Services (OSAS) from Mondays to Thursdays 7am – 6pm\n4. Pay P150 exam fee at Cashier Office and undergo exam as scheduled\n5. Get the exam result and Notice of Admission\n6. Undergo medical exam\n7. Submit original documents at University Registrar Office for enrolment"
            ]
        },
        {
            "id": 26,
            "tag": "contact_information",
            "patterns": [
                "How can I contact the admissions office?",
                "What is the contact number\/email of the admissions department?"
            ],
            "responses": [
                "Office of the Student Affairs and Services - cvsumainosas@cvsu.edu.ph for inquiries about course offering and admission inquiries \n  Office of the University Registrar - registrarmain@cvsu.edu.ph> for inquiries about TOR, Diploma, and Registrar related concerns \n University Webmaster - webmaster@cvsu.edu.ph> for technical problems found on the site and\/or any feedback about the systems"
            ]
        },
        {
            "id": 31,
            "tag": "application_deadlines",
            "patterns": [
                "What are the deadlines for application submission?",
                "When is the last date to apply for admission?"
            ],
            "responses": [
                "Application deadlines vary by program and intake. Check the official CvSU website for specific deadlines relevant to your application."
            ]
        },
        {
            "id": 33,
            "tag": "application_status_check",
            "patterns": [
                "How can I check my application status?",
                "Is there a way to track my admission application?"
            ],
            "responses": [
                "Track your application status by logging into your CvSU admission portal account for real-time updates."
            ]
        },
        {
            "id": 35,
            "tag": "admission_notification",
            "patterns": [
                "When will I receive the admission notification?",
                "How long does it take to hear back after applying?"
            ],
            "responses": [
                "Admission notifications are sent after the application review process. Expect to receive one within a few weeks to months after submitting your application."
            ]
        },
        {
            "id": 36,
            "tag": "application_withdrawal",
            "patterns": [
                "Can I withdraw my admission application?",
                "What is the procedure for canceling my application?"
            ],
            "responses": [
                "You can withdraw your admission application by submitting a formal request to the CvSU admission office."
            ]
        },
        {
            "id": 39,
            "tag": "application_document_submission_deadline",
            "patterns": [
                "When is the deadline of the submission of application documents?",
                "What is the last date to upload documents?"
            ],
            "responses": [
                "The deadline for submitting application documents is provided upon application submission. Please refer to posted updates."
            ]
        },
        {
            "id": 43,
            "tag": "application_data_update",
            "patterns": [
                "Can I update my application information after submission?",
                "Is it possible to make changes to my application?"
            ],
            "responses": [
                "Update your application information by contacting the CvSU admission office cvsumainosas@cvsu.edu.ph."
            ]
        },
        {
            "id": 46,
            "tag": "application_reconsideration",
            "patterns": [
                "Can my application be reconsidered after rejection?",
                "Is there an appeal process for rejected applications?"
            ],
            "responses": [
                "Please refer to posted updates."
            ]
        },
        {
            "id": 49,
            "tag": "application_confirmation",
            "patterns": [
                "How can I confirm that my application has been received?",
                "Is there a way to verify my application submission?"
            ],
            "responses": [
                "Upon successful submission, you'll receive a confirmation email or message acknowledging receipt of your application. You can also check the status of your application on the CvSU admission portal."
            ]
        },
        {
            "id": 52,
            "tag": "application_process_overview",
            "patterns": [
                "Can you provide an overview of the admission process?",
                "How does the entire application process work?"
            ],
            "responses": [
                "The admission process at CvSU Main Campus involves several steps, including application submission, document verification, review, and admission decision. For a detailed overview, you can refer to the admission guidelines on the official CvSU website."
            ]
        },
        {
            "id": 58,
            "tag": "application_submission_confirmation",
            "patterns": [
                "How will I know if my application has been successfully submitted?",
                "Is there a confirmation message upon application submission?"
            ],
            "responses": [
                "Upon successful submission of your application, you'll receive a confirmation message or email acknowledging receipt of your application. This confirms that your application has been successfully submitted for review."
            ]
        },
        {
            "id": 59,
            "tag": "admission_withdrawal_deadline",
            "patterns": [
                "Is there a deadline for withdrawing my admission acceptance?",
                "When can I cancel my enrollment without penalties?"
            ],
            "responses": [
                "Admitted students can typically withdraw their admission acceptance without penalties within a specified deadline. Be sure to review the admission offer letter for details on the withdrawal deadline."
            ]
        },
        {
            "id": 65,
            "tag": "application_materials_submission_deadline_extension",
            "patterns": [
                "Can I request an extension for submitting application materials?",
                "Is it possible to get more time for document submission?"
            ],
            "responses": [
                "In exceptional circumstances, you may request an extension for submitting application materials by contacting the CvSU admission office and explaining your situation. The decision on the extension request will be communicated to you."
            ]
        },
        {
            "id": 66,
            "tag": "application_review_delay_notification",
            "patterns": [
                "What happens if there's a delay in reviewing my application?",
                "Will I be notified if there's a delay in the application review process?"
            ],
            "responses": [
                "If there's a delay in reviewing your application, the CvSU admission office will notify you of the situation and provide updates on the expected timeline for application review."
            ]
        },
        {
            "id": 68,
            "tag": "application_submission_assistance",
            "patterns": [
                "I need help with submitting my application",
                "Can you assist me in completing my admission application?"
            ],
            "responses": [
                "Certainly! I can provide guidance and assistance with completing your admission application for CvSU Main Campus. Please let me know what specific help you need."
            ]
        },
        {
            "id": 70,
            "tag": "application_review_progress_check",
            "patterns": [
                "How can I check the progress of my application review?",
                "Is there a way to monitor the status of my application review?"
            ],
            "responses": [
                "You can monitor the progress of your application review by logging into your CvSU admission portal account. The portal provides real-time updates on the status of your application and any additional requirements."
            ]
        },
        {
            "id": 72,
            "tag": "application_submission_confirmation_resend",
            "patterns": [
                "Can I request a resend of the application submission confirmation?",
                "Is it possible to receive another confirmation of my application submission?"
            ],
            "responses": [
                "If you require another confirmation of your application submission, you can contact the CvSU admission office and request a resend of the confirmation message or email."
            ]
        },
        {
            "id": 73,
            "tag": "admission_offer_acceptance_confirmation",
            "patterns": [
                "How do I confirm my acceptance of the admission offer?",
                "What is the process for accepting the admission offer?"
            ],
            "responses": [
                "To confirm your acceptance of the admission offer, you'll typically need to follow the instructions provided in the admission  letter. This may involve submitting a confirmation form."
            ]
        },
        {
            "id": 85,
            "tag": "admission_withdrawal_notification",
            "patterns": [
                "How will I be notified if my admission acceptance is withdrawn?",
                "Is there a formal notification for admission withdrawal?"
            ],
            "responses": [
                "If your admission acceptance is withdrawn, you'll receive a formal notification from the CvSU admission office via email or message. The notification will include reasons for the withdrawal and any relevant instructions."
            ]
        },
        {
            "id": 92,
            "tag": "placement_tests",
            "patterns": [
                "Are there placement tests for incoming students?",
                "Do I need to take placement exams?"
            ],
            "responses": [
                "Some programs may require placement tests to assess your proficiency level in certain subjects. Check with the respective department for details."
            ]
        },
        {
            "id": 93,
            "tag": "special_programs",
            "patterns": [
                "Are there any special programs or initiatives for students?",
                "What special programs does CvSU offer?"
            ],
            "responses": [
                "CvSU offers various special programs and initiatives to enhance student learning and development. These may include research opportunities, internships, and community outreach projects."
            ]
        },
        {
            "id": 94,
            "tag": "student_clubs",
            "patterns": [
                "Are there student clubs and organizations?",
                "How can I join student clubs?"
            ],
            "responses": [
                "CvSU has a vibrant student life with numerous clubs and organizations covering various interests such as academic, cultural, and recreational. You can join clubs during club recruitment periods or inquire at the Student Affairs Office."
            ]
        },
        {
            "tag": "admission_criteria",
            "patterns": [
                "What criteria does CvSU consider for admission?",
                "How are applicants evaluated for admission?"
            ],
            "responses": [
                "CvSU considers factors like academic performance, entrance exam scores, extracurricular activities, and relevant qualifications for admission. Each program may have specific criteria."
            ]
        },
        {
            "tag": "admission_acceptance_deadline",
            "patterns": [
                "Is there a deadline for accepting the admission offer?",
                "When do I need to confirm my enrollment?"
            ],
            "responses": [
                "Admitted students are typically required to accept the admission offer by a specified deadline. The deadline for accepting the offer will be communicated along with the admission notification."
            ]
        },
        {
            "tag": "admission_confirmation_requirement",
            "patterns": [
                "Is there any action required to confirm my admission acceptance?",
                "What do I need to do after receiving the admission offer?"
            ],
            "responses": [
                "Upon receiving the admission offer, you'll typically need to confirm your acceptance by following the instructions provided in the admission offer letter. This may involve submitting a confirmation form or paying an admission deposit."
            ]
        },
        {
            "id": 1,
            "tag": "exam_date",
            "patterns": [
                "When is the exam date?"
            ],
            "responses": [
                "The examination date will be given when the prospective student finishes filling up their application form."
            ]
        },
        {
            "id": 1,
            "tag": "exam_time",
            "patterns": [
                "What is the time of exam?"
            ],
            "responses": [
                "Please refer to posted updates."
            ]
        },
        {
            "id": 2,
            "tag": "scholarship",
            "patterns": [
                "What are the available scholarships in CvSU?",
                "Is there a maintaining grade for scholarship?",
                "How do I apply to scholarship programs?",
                "What are the needed requirements for obtaining a scholarship?",
                "Is there a student assistance scholarship?",
                "Where do I get the certificate of enrollment for scholarship?"
            ],
            "responses": [
                "All queries regarding scholarship concerns can be\r\naddressed thru osasmain.scholarship@cvsu.edu.ph"
            ]
        },
        {
            "id": 3,
            "tag": "shifting",
            "patterns": [
                "Is it possible to shift to a more than 4-year course without paying?",
                "Is it possible to shift courses even if the strand is not inline?",
                "What is the process of shifting to another program?",
                "Does shifting need summer classes?"
            ],
            "responses": [
                "Shifting concerns is beyond the OSAS scope. The shifting process is being done through the Colleges."
            ]
        },
        {
            "id": 4,
            "tag": "tuition_fee",
            "patterns": [
                "Does the university have a tuition fee?",
                "Is everyone qualified for Free Tuition Law?"
            ],
            "responses": [
                "All queries regarding scholarship concerns can be addressed\r\nthru registrarmain@cvsu.edu.ph."
            ]
        },
        {
            "id": 5,
            "tag": "required_documents",
            "patterns": [
                "What are the required documents that need to be submitted?"
            ],
            "responses": [
                "Please specify your application category:\r\n\r\n- Grade 12 students\r\n- SHS Graduate\r\n- ALS Passers\r\n- Associate, Certificate, Vocational, or Diploma Degree Holder\r\n- Transferee Applicant\r\n- Second-Course Applicant\r\n- TCP Applicant"
            ]
        },
        {
            "id": 8,
            "tag": "satellite_campuses",
            "patterns": [
                "How can I apply to satellite campuses if I pass in the main campus?"
            ],
            "responses": [
                "Read the announcement on the satellite campus' page on how to apply."
            ]
        },
        {
            "id": 9,
            "tag": "re-application",
            "patterns": [
                "What are the requirements for re-application?",
                "What are the requirements for reapplication?"
            ],
            "responses": [
                "Applicants just have to read the announcement that will be posted in the future to be\nguided."
            ]
        },
        {
            "id": 10,
            "tag": "give_slot",
            "patterns": [
                "Is it possible to give my slot to another student who failed the entrance exam?"
            ],
            "responses": [
                "No. Applicant do not have that kind of right to transfer their slot to another applicant."
            ]
        },
        {
            "id": 11,
            "tag": "applicants_capacity",
            "patterns": [
                "How many applicants will be accepted for admission?"
            ],
            "responses": [
                "It depends on the capacity of each college."
            ]
        },
        {
            "id": 12,
            "tag": "grade_12_applicant_reqs",
            "patterns": [
                "Grade 12 applicants requirements."
            ],
            "responses": [
                "For Grade 12 Students\r\n Copy of accomplished application form for admission;\r\n Photocopy of Grade 11 card;\r\n Certificate from the Principal or Adviser indicating that the\r\napplicant is currently enrolled as Grade 12 student and\r\nthe strand is also indicated;\r\n The certificate must be originally signed. E-\r\nsignature is not allowed.\r\n Ordinary A4-size folder"
            ]
        },
        {
            "id": 13,
            "tag": "shs_graduate_applicant_reqs",
            "patterns": [
                "SHS Graduate applicants requirements."
            ],
            "responses": [
                "For SHS Graduate\r\n Copy of accomplished application form for admission;\r\n Photocopy of completed Grade 12 report card;\r\n Certificate of non-issuance of Form 137 for College\r\nAdmission (this certification shall prove that the applicant\r\nhas never been enrolled in another university\/college);\r\nand\r\n Ordinary A4-size folder"
            ]
        },
        {
            "id": 14,
            "tag": "als_passers_reqs",
            "patterns": [
                "ALS Passers applicants requirements."
            ],
            "responses": [
                "For ALS Passers\n Copy of accomplished application form for admission;\n Photocopy of Certificate of Rating (COR) with eligibility to\nenroll in college; and\n Ordinary A4-size folder"
            ]
        },
        {
            "id": 15,
            "tag": "acvd_applicants_reqs",
            "patterns": [
                "Associate applicants requirements.",
                "Certificate applicants requirements.",
                "Vocational applicants requirements.",
                "Diploma Degree Holder applicants requirements."
            ],
            "responses": [
                "For Associate, Certificate, Vocational, or Diploma Degree\r\nHolder\r\n\r\n Copy of accomplished application form for admission;\r\n Photocopy of Transcript of Records (TOR) with graduation\r\ndate; and\r\n Ordinary A4-size folder"
            ]
        },
        {
            "id": 16,
            "tag": "transferee_applicants_reqs",
            "patterns": [
                "Transferee applicants requirements.",
                "Transferring requirements."
            ],
            "responses": [
                "TRANSFEREE APPLICANTS\r\n Copy of accomplished application form for admission;\r\n Photocopy of Transcript of Records\/Certificate of Grades"
            ]
        },
        {
            "id": 17,
            "tag": "second_course_applicants",
            "patterns": [
                "Second course applicants requirements.",
                "Applying for second semester.",
                "2nd sem requirements."
            ],
            "responses": [
                "SECOND-COURSE APPLICANTS\n Copy of accomplished application form for admission; and\n Photocopy of Transcript of Records with graduation date\n Ordinary Short white folder"
            ]
        },
        {
            "id": 18,
            "tag": "tcp_applicants_reqs",
            "patterns": [
                "Tcp applicants requirements"
            ],
            "responses": [
                "TCP APPLICANTS\r\n Copy of accomplished application form for admission; and\r\n Photocopy of Transcript of Records with indication of\r\ngraduation date"
            ]
        }
    ]
}